#!/bin/bash
#############################################################
# Данный скрипт запускается при отключении одного из PPPoE каналов для доступа в сеть Интернет.
#############################################################
source global.sh

### LOG ###
echo "`date +%D\ %T` $0: DISCONNECT PPPoE ($PPP_IFACE | $PPP_LOCAL)" >> "$log_file"

### ROUTE ###
$path/route_ppp_down.sh

### SNAT: Удаление: для подмены исходного ip адреса пакетов на ip адрес сетевого интерфейса для проброса из ЛВС в сеть Интернет ###
iptables -t nat -D POSTROUTING ! -s "$PPP_LOCAL" -o "$PPP_IFACE" -j SNAT --to-source "$PPP_LOCAL"

### Сбросить кеш таблиц маршрутизации отключившегося канала
conntrack -D -q "$PPP_LOCAL"

##########################################
